# 데이터 분석을 위한 파이썬 기초2

In [3]:
#로컬 네임스페이스로 Series와 DataFrame을 불러오기
from pandas import Series, DataFrame
#pandas를 pd라는 이름으로 불러오기
import pandas as pd
#numpy를 np라는 이름으로 불러오기
import numpy as np
#directory 설정을 위한 module불러오기
import os

In [7]:
#디렉토리 설정하기
os.chdir('C:\\Users\\AJ\\Desktop\\실습\\pydata-book-1st-edition\\pydata-book-1st-edition')
#현재 설정된 디렉토리 확인하기
os.getcwd()

'C:\\Users\\AJ\\Desktop\\실습\\pydata-book-1st-edition\\pydata-book-1st-edition'

## 지난시간 질문 내용 보충 설명

In [26]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
#data를 2가지 조건으로 가져오기
data[(data['one']<10) & (data['two']<7)]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [28]:
#특정 조건을 만족할때 특정 값을 부여하기
data['one']=np.where(data['one']<10,1,0)

In [29]:
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    0   13     14    15

### 누락된 데이터 처리하기

In [128]:
#미싱데이터를 포함한 문자열 Series
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [127]:
#미싱데이터를 포함하고 있는지 확인하기
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [129]:
#첫 번째 값을 missing 처리하고 다시 확인
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 누락된 데이터 골라내기

In [30]:
from numpy import nan as NA
# np.nan이 아니라 NA로만 써도 missing value로 생성되게 해줌
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [132]:
#누락된 데이터 삭제하기
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [133]:
#동일한 기능의 다른 코드
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [31]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [443]:
# DataFrame 에서 missing data를 누락 시키는 두가지 방식
cleaned=data.dropna()  
#1)하나라도 NaN이 있는 행이 삭제된다.
cleaned

     0    1    2
0  1.0  6.5  3.0

In [136]:
data.dropna(how='all')
# 2)전체가 NaN인 행만 삭제된다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [444]:
data[4] = NA  
#없는 인덱스를 입력하는 경우 그 인덱스를 생성한다
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [140]:
#axis=1 옵션을 추가하면 모든'행'에 대해서 적용
#모든 행이 Nan이면 삭제
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [103]:
df = DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA; df.iloc[:2, 2] = NA
df

          0         1         2
0  0.775856       NaN       NaN
1  0.128742       NaN       NaN
2 -0.606788       NaN  0.248523
3  0.482820       NaN  0.762391
4 -0.309521 -0.860557 -1.807901
5  0.301527 -0.644950  1.951192
6 -0.906388 -0.669670  0.112724

In [39]:
#삭제할 때의 기준 값을 주는 경우
df.dropna(thresh=2)  #한 행 내에서 값이 없는 셀의 개수가 thresh 이상이면 그 행 drop

          0         1         2
2  0.833442       NaN  0.937097
3 -0.118470       NaN -0.500508
4 -0.149965 -0.909179 -0.139680
5 -1.082360 -1.047539  0.396218
6  1.267964 -0.690624 -1.228752

In [40]:
df.dropna(axis=1,thresh=4)  
#축 방향을 1로 지정하여 한 열 내에서 값이 없는 셀의 개수가 thresh 이상이면 그 행 drop

          0         2
0 -0.013539       NaN
1  0.074918       NaN
2  0.833442  0.937097
3 -0.118470 -0.500508
4 -0.149965 -0.139680
5 -1.082360  0.396218
6  1.267964 -1.228752

### 누락된 값 채우기

In [41]:
#누락 된 값을 특정 값으로 채우기
df.fillna(0)

          0         1         2
0 -0.013539  0.000000  0.000000
1  0.074918  0.000000  0.000000
2  0.833442  0.000000  0.937097
3 -0.118470  0.000000 -0.500508
4 -0.149965 -0.909179 -0.139680
5 -1.082360 -1.047539  0.396218
6  1.267964 -0.690624 -1.228752

In [42]:
#특정 열의 Nan 값을 지정하여 채우기
df.fillna({1: 0.5, 2: -1}) 
#두 번째 열의 NaN에 0.5, 세 번째 열의 NaN -1 채우기

          0         1         2
0 -0.013539  0.500000 -1.000000
1  0.074918  0.500000 -1.000000
2  0.833442  0.500000  0.937097
3 -0.118470  0.500000 -0.500508
4 -0.149965 -0.909179 -0.139680
5 -1.082360 -1.047539  0.396218
6  1.267964 -0.690624 -1.228752

In [46]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [45]:
#missing value를 근처의 값으로 채우기
#1)같은 열에서 직전 값으로 채움  #ffill 대신 bfill을 사용하면 뒤의 값으로 채워 넣는다.
data.fillna(method='ffill')

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0

In [170]:
#2)같은 행에서 직전 값으로 채움
data.fillna(axis=1,method='ffill')

          0         1         2
0 -0.017141  0.680321  0.635512
1 -0.757177  0.718086 -0.304273
2 -1.677790 -1.677790 -1.563740
3 -0.367488 -0.367488  1.219954
4 -0.247699 -0.247699 -0.247699
5 -1.844788 -1.844788 -1.844788

In [171]:
#채워서 내려가는 횟수에 제한 두기
data.fillna(method='ffill', limit=2)

          0         1         2
0 -0.017141  0.680321  0.635512
1 -0.757177  0.718086 -0.304273
2 -1.677790  0.718086 -1.563740
3 -0.367488  0.718086  1.219954
4 -0.247699       NaN  1.219954
5 -1.844788       NaN  1.219954

In [172]:
data = Series([1., NA, 3.5, NA, 7])

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [49]:
df

          0         1         2
0 -0.013539       NaN       NaN
1  0.074918       NaN       NaN
2  0.833442       NaN  0.937097
3 -0.118470       NaN -0.500508
4 -0.149965 -0.909179 -0.139680
5 -1.082360 -1.047539  0.396218
6  1.267964 -0.690624 -1.228752

In [53]:
#평균으로 채우기
#DataFrame에서는 mean의 axis 방향을 지정하여 채울 수도 있다.
df.fillna(df.mean())   #df.fillna(df.mean(axis=1))

          0         1         2
0 -0.013539 -0.882447 -0.107125
1  0.074918 -0.882447 -0.107125
2  0.833442 -0.882447  0.937097
3 -0.118470 -0.882447 -0.500508
4 -0.149965 -0.909179 -0.139680
5 -1.082360 -1.047539  0.396218
6  1.267964 -0.690624 -1.228752

In [63]:
df.mean()

0    0.115998
1   -0.882447
2   -0.107125
dtype: float64

### 정렬과 순위

In [64]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [65]:
obj.sort_index()  #index 순서대로 정렬

a    1
b    2
c    3
d    0
dtype: int32

In [66]:
#index 기준이 아닌 value기준으로 정렬 할때는 sort_values()를 이용한다.
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int32

In [77]:
df

          0         1         2
0 -0.013539       NaN       NaN
1  0.074918       NaN       NaN
2  0.833442       NaN  0.937097
3 -0.118470       NaN -0.500508
4 -0.149965 -0.909179 -0.139680
5 -1.082360 -1.047539  0.396218
6  1.267964 -0.690624 -1.228752

In [105]:
df.columns=['d', 'a', 'b']
df

          d         a         b
0  0.775856       NaN       NaN
1  0.128742       NaN       NaN
2 -0.606788       NaN  0.248523
3  0.482820       NaN  0.762391
4 -0.309521 -0.860557 -1.807901
5  0.301527 -0.644950  1.951192
6 -0.906388 -0.669670  0.112724

In [82]:
df.sort_index()  #행의 index를 기준으로 정렬

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [69]:
df.sort_values(by='b')  #b 열의 값을 기준으로 정렬

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [86]:
df.sort_values(by=['b','d'])  #복수의 열에 대한 기준도 설정할 수 있다.

          d         a         b
6  1.267964 -0.690624 -1.228752
3 -0.118470       NaN -0.500508
4 -0.149965 -0.909179 -0.139680
5 -1.082360 -1.047539  0.396218
2  0.833442       NaN  0.937097
0 -0.013539       NaN       NaN
1  0.074918       NaN       NaN

In [87]:
df.sort_index(axis=1)  #열의 index인 column이름을 기준으로 정렬

          a         b         d
0       NaN       NaN -0.013539
1       NaN       NaN  0.074918
2       NaN  0.937097  0.833442
3       NaN -0.500508 -0.118470
4 -0.909179 -0.139680 -0.149965
5 -1.047539  0.396218 -1.082360
6 -0.690624 -1.228752  1.267964

In [89]:
#역순으로 정렬할 때는 ascending옵션을 False로 해주면 된다. 
df.sort_index(axis=1, ascending=False)

          d         b         a
0 -0.013539       NaN       NaN
1  0.074918       NaN       NaN
2  0.833442  0.937097       NaN
3 -0.118470 -0.500508       NaN
4 -0.149965 -0.139680 -0.909179
5 -1.082360  0.396218 -1.047539
6  1.267964 -1.228752 -0.690624

In [415]:
#임의의 Series를 생성
obj = Series([7, -5, 7, 4, 2, 0, 4])
#각 값의 순위를 매겨서 반환한다. 동점이 있을 경우 평균 순위를 부여
obj.rank()  #낮을수록 높은 순위   obj.rank(ascending=False)로하면 반대로 된다.

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [416]:
obj.rank(method='first') #동점이 있을 경우 데이터에서 먼저 나오는 순으로 순위

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [418]:
obj.rank(method='max') #동점자가 있는 경우 높은 등수를  부여

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [ ]:
obj.rank(methond='min') #동점자가 있는 경우 낮은 등수를 부여

In [421]:
#이하 데이터프레임에 적용하는 방법도 유사
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [422]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

# 실습 예제1
#### 앞에서 생성한 df를 불러와서 아래의 작업들을 수행하라.
#### Q1. df의 열들을 알파벳 순서로 정렬하라. 
#### Q2. a열에 세번째, 네번째 행의 값은 다섯번째 값으로 채우고, 나머지 빈칸은 평균값으로 채워라.
#### Q3. b열의 빈칸은 나머지 값들의 합으로 채워라.
#### Q4. a열, b열 순으로 기준을 주고 내림차순 정렬하라.

In [106]:
df

          d         a         b
0  0.775856       NaN       NaN
1  0.128742       NaN       NaN
2 -0.606788       NaN  0.248523
3  0.482820       NaN  0.762391
4 -0.309521 -0.860557 -1.807901
5  0.301527 -0.644950  1.951192
6 -0.906388 -0.669670  0.112724

In [107]:
#solution
#### Q1. df의 열들을 알파벳 순서로 정렬하라. 
df=df.sort_index(axis=1) 
df

          a         b         d
0       NaN       NaN  0.775856
1       NaN       NaN  0.128742
2       NaN  0.248523 -0.606788
3       NaN  0.762391  0.482820
4 -0.860557 -1.807901 -0.309521
5 -0.644950  1.951192  0.301527
6 -0.669670  0.112724 -0.906388

In [108]:
#### Q2. a열에 세번째, 네번째 행의 값은 다섯번째 값으로 채우고, 나머지 빈칸은 평균값으로 채워라.
df['a']=df['a'].fillna(method='bfill', limit=2)
df

          a         b         d
0       NaN       NaN  0.775856
1       NaN       NaN  0.128742
2 -0.860557  0.248523 -0.606788
3 -0.860557  0.762391  0.482820
4 -0.860557 -1.807901 -0.309521
5 -0.644950  1.951192  0.301527
6 -0.669670  0.112724 -0.906388

In [109]:
df['a']=df['a'].fillna(df['a'].mean())
df

In [110]:
#### Q3. b열의 빈칸은 나머지 값들의 합으로 채워라.
df['b']=df['b'].fillna(df['b'].sum())
df

          a         b         d
0 -0.779258  1.266929  0.775856
1 -0.779258  1.266929  0.128742
2 -0.860557  0.248523 -0.606788
3 -0.860557  0.762391  0.482820
4 -0.860557 -1.807901 -0.309521
5 -0.644950  1.951192  0.301527
6 -0.669670  0.112724 -0.906388

In [111]:
#### Q4. a열, b열 순으로 기준을 주고 내림차순 정렬하라.
df.sort_values(by=['a','b'], ascending=False)

          a         b         d
5 -0.644950  1.951192  0.301527
6 -0.669670  0.112724 -0.906388
0 -0.779258  1.266929  0.775856
1 -0.779258  1.266929  0.128742
3 -0.860557  0.762391  0.482820
2 -0.860557  0.248523 -0.606788
4 -0.860557 -1.807901 -0.309521